{
    "personalInformation": {
        "name": "Eduardo Schoepf",
        "address": "",
        "city": "Paris",
        "phone": "+33652543966",
        "email": "eduardo.schoepf@hotmail.com",
        "desiredPosition": {
            "en": "Software Developer",
            "fr": "Développeur Logiciel",
            "pt": "Desenvolvedor de software"
        }
    },
    "aboutMe": {
        "summary": {
            "en": "Hi there, I'm Eduardo Schoepf, and my journey into the world of software development began in 2016, when I obtained my professional title of software developer. These studies allowed me to develop my skills in XML, HTML5, CSS3, JavaScript, jQuery, Ajax, PHP5, SQL, UML, MySQL and object-oriented programming. It was also an opportunity to put my theoretical learning into practice during a three-month internship, during which I had the chance to develop a web application in PHP5, model a MySQL database and set up unit tests. In 2017, I started my programming career at a startup in Montpellier, in the south of France, where I took part in a project to develop a multiplatform application with Ionic, Cordova and AngularJS. A year later, I made the transition to the public sector. My current role involves analyzing XML flows and resolving incident tickets, as well as contributing to the integration of new colleagues. Passionate about the field of software development, I'm currently studying software engineering and am looking for a challenge in a software development team.",
            "fr": "Développeur JavaScript confirmé, je poursuis actuellement des études en développement logiciel et j'ai un intérêt particulier pour le langage Java et, plus précisément, pour le framework Spring. Je suis à la recherche d’un nouveau challenge en tant que Développeur Java.",
            "pt": "Desenvolvedor de software com experiência em JavaScript e AngularJS, atualmente focado em aprender Java, com ênfase no framework Spring. Estou buscando novas oportunidades no Brasil a partir de dezembro de 2024."
        }
    },
    "mediaLinks": [
        {
            "name": "PT",
            "address": "documents/cv_eduardo_schoepf_pt.pdf"
        },
        {
            "name": "EN",
            "address": "documents/cv_eduardo_schoepf_en.pdf"
        },
        {
            "name": "FR",
            "address": "documents/cv_eduardo_schoepf_fr.pdf"
        }
    ],
    "socialNetworks": [
        {
            "name": "linkedin",
            "link": "https://www.linkedin.com/in/eduardoschoepf"
        },
        {
            "name": "github",
            "link": "https://github.com/eduardoschoepf"
        }
    ],
    "workExperience": [
        {
            "position": {
                "en": "IT Support",
                "fr": "Spécialiste en support logiciel",
                "pt": "Especialista em suporte de software"
            },
            "company": "Centre informatique douanier",
            "location": "Osny - FR",
            "period": {
                "en": "2018 - Present",
                "fr": "2018 - Actuel",
                "pt": "2018 - Atual"
            },
            "description": {
                "en": "In my current role, I have developed expertise in analyzing XML and JSON flows to detect technical and functional problems and offer solutions to users. I also contribute to the process of training and integrating new team members, strengthening our collaboration and collective efficiency. As a developer, I have created solutions to simplify repetitive tasks for the support team, such as contextual menus to perform searches from a selection of text. This ability to improve operational processes is the result of my solid experience in software development.",
                "fr": "Je suis actuellement affecté à un service chargé de traiter les anomalies dans le système douanier.  J'ai développé une expertise dans l'analyse des flux XML et JSON pour résoudre les problèmes techniques et fonctionnels dans les déclarations d'importation et d'exportation. J'ai créé des solutions pour l'équipe d'assistance dans le but de simplifier les tâches répétitives. Par exemple, j'ai développé des extensions web qui permettent de créer des menus contextuels facilitant la recherche par sélection de texte. Mon expérience en matière de développement de logiciels a été essentielle pour améliorer ces processus opérationnels et rendre le service plus efficace.",
                "pt": "Atualmente, trabalho em um serviço responsável por tratar as anomalias no sistema alfandegário. Na minha função atual, desenvolvi expertise na análise de fluxos XML e JSON para solucionar problemas técnicos e funcionais nas declarações de importação e exportação. Também contribuo com o processo de treinamento e integração de novos membros da equipe, fortalecendo nossa colaboração e eficiência coletiva. Como programador, criei soluções para simplificar tarefas repetitivas da equipe de suporte, como menus contextuais para efetuar buscas a partir de uma seleção de texto. Minha experiência em desenvolvimento de software tem sido essencial para aprimorar esses processos operacionais e tornar o serviço mais eficaz."
            }
        },
        {
            "position": {
                "en": "JavaScript Developer",
                "fr": "Développeur Javascript",
                "pt": "Desenvolvedor Javascript"
            },
            "company": "Mobixio",
            "location": "Montpellier - FR",
            "period": {
                "en": "2017 - 2018",
                "fr": "2017 - 2018",
                "pt": "2017 - 2018"
            },
            "description": {
                "en": "In 2017, I was employed as a JavaScript developer in Mobixio's app development team. I collaborated on the design and feature implementation of the Yoozcool app - a cross-platform mobile application designed for real-time tracking of the status of a transportation fleet, and facilitating direct communication channels with drivers. The platform was developed using Ionic, Cordova, AngularJS and Leaflet technologies. My adaptability enabled me to quickly master the AngularJS framework, making a significant contribution to the success of the project.",
                "fr": "En 2017, j'ai rejoint l'équipe de développement de Mobixio en tant que développeur Javascript, où j'ai contribué à la conception et à la mise en place de fonctionnalités pour l’application Yoozcool. Cette application mobile multiplateforme avait pour objectif de permettre le suivi en temps réel de l'état d'une flotte de transport. Pour ce projet, j'ai utilisé un ensemble de technologies comprenant Ionic, Cordova, AngularJS et Leaflet. Ma capacité d'adaptation m'a permis d'assimiler rapidement le framework AngularJS, ce qui a grandement facilité mon intégration au sein de l'équipe et a contribué de manière significative au projet.",
                "pt": "Em 2017, integrei o time de desenvolvimento Mobixio na função de Desenvolvedor Javascript, onde contribuí para o design e implementação de funcionalidades do aplicativo Yoozcool. O objetivo desta aplicação móvel multiplataforma era permitir a monitorização em tempo real do estado de uma frota de transporte. Para este projeto, usei um conjunto de tecnologias, incluindo Ionic, Cordova, AngularJS, e Leaflet. Minha capacidade de adaptação me permitiu assimilar rapidamente a framework AngularJS, o que facilitou muito a minha integração à equipe e contribuiu significativamente para o projeto."
            }
        },
        {
            "position": {
                "en": "Software developer internship",
                "fr": "Stage de développeur logiciel",
                "pt": "Estágio de desenvolvedor de software"
            },
            "company": "O+ Studio",
            "location": "Montpellier - FR",
            "period": {
                "en": "2016 (3 months)",
                "fr": "2016 (3 mois)",
                "pt": "2016 (3 meses)"
            },
            "description": {
                "en": "This 10-week end-of-studies internship enabled me to put into practice the subjects I had covered during my studies, in particular the modeling of a MySQL database and the creation of a PHP5 web application.",
                "fr": "Ce stage de fin d'études, d'une durée de dix semaines, a sans aucun doute été important pour ma formation de développeur logiciel. Le travail effectué pendant ce stage m'a permis de mettre en pratique les sujets abordés pendant mes études, notamment la modélisation d'une base de données MySQL et la création d'une application web en PHP5.",
                "pt": "Esse estágio de dez semanas no final dos estudos foi sem dúvida importante para a minha formação como desenvolvedor de software. O trabalho realizado durante o estágio me permitiu colocar em prática os assuntos abordados durante meus estudos, especialmente a modelagem de um banco de dados MySQL e a criação de um aplicativo web em PHP5."
            }
        }
    ],
    "education": [
        {
            "degree": {
                "en": "Bachelor's degree in Software Engineering",
                "fr": "Software Engineering (BAC +4)",
                "pt": "Bacharelado em Engenharia de Software"
            },
            "institution": "UNINTER",
            "type": {
                "en": "Distance learning Bachelors",
                "fr": "EAD",
                "pt": "EAD"
            },
            "location": "Santa Cruz do Sul - BR",
            "period": {
                "en": "2023 - 2027",
                "fr": "2023 - 2027",
                "pt": "2023 - 2027"
            },
            "description": {
                "en": "The software engineering curriculum focuses on project management, software architecture, algorithms, data structures, software development ethics and legislation.",
                "fr": "Le programme de formation en génie logiciel est axé sur la gestion de projet, l'architecture logicielle, les algorithmes, les structures de données, l'éthique et la législation en matière de développement de logiciels.",
                "pt": "O programa da graduação em engenharia de software da Uninter tem como foco o gerenciamento de projetos, a arquitetura de software, algoritmos e estruturas de dados, a ética e legislação no desenvolvimento de software e outras atividades do ciclo de vida do software."
            }
        },
        {
            "degree": {
                "en": "Professional Title of Software Developer (350 hours)",
                "fr": "Développeur d’applications mobiles (350 heures)",
                "pt": "Desenvolvedor de aplicativos móveis (350 horas)"
            },
            "institution": "HUMAN BOOSTER",
            "type": {
                "en": "350-hour training course",
                "fr": "Formation de 350 heures",
                "pt": "Treinamento de 350 horas"
            },
            "location": "Montpellier - FR",
            "period": {
                "en": "2016",
                "fr": "2016",
                "pt": "2016"
            },
            "description": {
                "en": "Introduction to the Swift programming language for developing IOS applications and the Java language for developing Android applications.",
                "fr": "Initiation au langage de programmation Swift pour le développement d’applications IOS et au langage Java pour le développement d’applications Android.",
                "pt": "Introdução à linguagem de programação Swift para o desenvolvimento de aplicativos IOS e à linguagem Java para o desenvolvimento de aplicativos Android."
            }
        },
        {
            "degree": {
                "en": "Professional Title of Software Developer (1225 hours)",
                "fr": "Titre professionnel de développeur logiciel (1225 heures)",
                "pt": "Título profissional de Desenvolvedor de Software (1225 horas)"
            },
            "institution": "OBJECTIF 3W",
            "type": {
                "en": "Professional Title BAC +2",
                "fr": "Titre professionnel BAC +2",
                "pt": "Título profissional BAC +2"
            },
            "location": "Montpellier - FR",
            "period": {
                "en": "2015 - 2016",
                "fr": "2015 - 2016",
                "pt": "2015 - 2016"
            },
            "description": {
                "en": "This program includes fundamental concepts such as algorithms, data structures and object-oriented programming. It includes learning the following programming languages and technologies: UML (object modeling language), PHP5, SQL, JavaScript, jQuery, Ajax, XML, HTML5 and CSS3.",
                "fr": "Ce programme couvre des concepts fondamentaux tels que les algorithmes, les structures de données et la programmation orientée objet. Il inclut l'apprentissage des langages de programmation et technologies suivants : UML (langage de modélisation d'objets), PHP5, SQL, JavaScript, jQuery, Ajax, XML, HTML5 et CSS3.",
                "pt": "Este programa abrange conceitos fundamentais, como algoritmos, estruturas de dados e programação orientada a objetos. Ele inclui o aprendizado das seguintes linguagens e tecnologias de programação: UML (linguagem de modelagem de objetos), PHP5, SQL, JavaScript, jQuery, Ajax, XML, HTML5 e CSS3."
            }
        }
    ],
    "projects": [
        {
            "title": {
                "en": "Movies WebApp",
                "fr": "Movies WebApp",
                "pt": "Movies WebApp"
            },
            "description": {
                "en": "Movies is a web application developed with Java Spring Boot. It allows users to browse popular movies based on The Movie Database (TMDb) API.",
                "fr": "Movies est une application web développée avec Java Spring Boot. Elle permet aux utilisateurs de parcourir les films les plus populaires en se basant sur l'API de The Movie Database (TMDb).",
                "pt": "Movies é uma aplicação Web desenvolvida com Java Spring Boot. Permite aos utilizadores pesquisar filmes populares com base na API da base de dados de filmes (TMDb)."
            },
            "img": "movies_webapp.png",
            "url": "https://github.com/eduardoschoepf/movies-webapp"
        },
        {
            "title": {
                "en": "Java Spring API",
                "fr": "API Java Spring",
                "pt": "API Java Spring"
            },
            "description": {
                "en": "Creation of an API with starters such as Spring Web, Spring Data JPA for data persistence management, and H2 Database for an in-memory database. Configuration of a Controller package, a Service package for business logic, a Repository package for interactions with the database, and a model package for entities. In the Controller package, create a class to manage CRUD (Create, Read, Update, Delete) operations.",
                "fr": "Création d'une API avec des starters tels que Spring Web, Spring Data JPA pour la gestion de la persistance des données, et H2 Database pour une base de données en mémoire. Configuration d'un package Controller, d'un package Service pour la logique métier, d'un package Repository pour les interactions avec la base de données et d'un package model pour les entités. Dans le package Controller, création d'une classe pour gérer les opérations CRUD (Créer, Lire, Mettre à jour, Supprimer).",
                "pt": "Criação de uma API com starters como Spring Web, Spring Data JPA para gerenciamento de persistência de dados e H2 Database para um banco de dados em memória. Configuração de um package Controller, um package Service para lógica de negócios, um package Repository para interações com o banco de dados e um package model para entidades. No package Controller, criação de uma classe para gerenciar operações CRUD (Criar, Ler, Atualizar, Excluir)."
            },
            "img": "api_img.jpg",
            "url": "https://github.com/eduardoschoepf/api"
        },
        {
            "title": {
                "en": "Java Spring WebApp",
                "fr": "App Web Java Spring",
                "pt": "App Web Java Spring"
            },
            "description": {
                "en": "Creation of an employee management tool with the following functionalities: view employees, add a new employee, modify an employee and delete an employee. The application connects to an API to retrieve the list of employees.",
                "fr": "Création d'un outil de gestion des collaborateurs avec les fonctionnalités suivantes : afficher la liste des collaborateurs, ajouter un nouveau collaborateur, modifier ou supprimer un collaborateur. L'application se connecte à une API pour récupérer la liste des employés.",
                "pt": "Criação de uma ferramenta de gerenciamento de funcionários com as seguintes funcionalidades: visualizar funcionários, adicionar um novo funcionário, modificar ou excluir um funcionário. O aplicativo se conecta a uma API para recuperar a lista de funcionários."
            },
            "img": "employees_webapp.png",
            "url": "https://github.com/eduardoschoepf/webapp"
        },
        {
            "title": {
                "en": "Movies APP",
                "fr": "Movies APP",
                "pt": "Movies APP"
            },
            "description": {
                "en": "This application was developed as a result of my studies in React Native. The application connects to the TMDB API to retrieve information on movies and TV shows.",
                "fr": "Cette application a été développée à la suite de mes études en React Native. L'application se connecte à l'API TMDB pour récupérer des informations sur les films et les séries télévisées.",
                "pt": "Este aplicativo foi desenvolvido como resultado de meus estudos em React Native. O aplicativo se conecta à API do TMDB para recuperar informações sobre filmes e programas de TV."
            },
            "img": "movies_app.png",
            "url": "https://github.com/eduardoschoepf/movies"
        }
    ],
    "skills": [
        "JavaScript",
        "Java",
        "Spring Boot",
        "SAP ABAP"
    ],
    "languages": [
        {
            "language": {
                "en": "French",
                "fr": "Français",
                "pt": "Francês"
            },
            "level": {
                "en": "Advanced",
                "fr": "Avancé",
                "pt": "Avançado"
            }
        },
        {
            "language": {
                "en": "Portuguese",
                "fr": "Portugais",
                "pt": "Português"
            },
            "level": {
                "en": "Advanced",
                "fr": "Avancé",
                "pt": "Avançado"
            }
        }
    ],
    "certifications": [
        {
            "certificate": "",
            "institution": "",
            "completionYear": ""
        }
    ]
}
