{
    "personalInformation": {
        "name": "Eduardo Schoepf",
        "address": "",
        "city": "Paris",
        "phone": "+33652543966",
        "email": "eduardo.schoepf@hotmail.com",
        "desiredPosition": "Software Engineer"
    },
    "aboutMe": {
        "summary": "Hi there! 👋 \nI'm Eduardo Schoepf, and my journey in the world of software development began in 2015. Since then, I've been on a path filled with challenges and achievements that have solidified my passion for the technology field. \n🌍 Beyond code, I'm a world explorer, believing that diversity of experiences is the key to creativity. I enjoy teamwork, where communication is the secret to successful challenges. And, of course, I love challenges, as each bug is an opportunity to learn something new! 🚀 I'm always open to new opportunities and interesting challenges. Let's create something amazing together!"
    },
    
    "socialMedias": [
        {
            "name":"linkedin", 
            "link":"https://www.linkedin.com/in/eduardoschoepf"
        },
        {
            "name":"github",
            "link":"https://github.com/eduardoschoepf"
        }
    ],
    "workExperience": [
        {
            "position": "IT Support",
            "company": "Public administration",
            "location": "Paris - FR",
            "period": "2018 - Present",
            "description": "In my current role, I've specialized in analyzing XML flows and resolving incident tickets. I contribute to the process of integrating new colleagues into the team. This experience has not only honed my technical skills, but also underlined the importance of effective teamwork and communication."
        },
        {
            "position": "JavaScript Developer",
            "company": "Mobixio",
            "location": "Montpellier - FR",
            "period": "2017 - 2018",
            "description": "In 2017, I was employed as a JavaScript developer in Mobixio's app development team. I collaborated on the design and feature implementation of the Yoozcool app - a cross-platform mobile application designed for real-time tracking of the status of a transportation fleet, and facilitating direct communication channels with drivers. The platform was developed using Ionic, Cordova, AngularJS and Leaflet technologies. My adaptability enabled me to quickly master the AngularJS framework, making a significant contribution to the success of the project."
        },
        {
            "position": "Software developer internship",
            "company": "O+ Studio",
            "location": "Montpellier - FR",
            "period": "2016 (3 months)",
            "description": "This end-of-studies internship, lasting ten weeks, carried out within the company O plus Studio, punctuated my training as a software developer followed at Objectif 3W. The work done during this internship allowed me to put my training into practice. Missions and tasks carried out: • model a MySQL database; • create a web application in PHP5; • implement unit tests."
        }
    ],
    "education": [
        {
            "degree": "Bachelor of Software Engineer",
            "institution": "UNINTER",
            "type": "Distance learning Bachelors",
            "location": "Santa Cruz do Sul - BR",
            "period": "2023 - 2027",
            "description": "The Software Engineering degree course focuses on the following areas: software development, software project management, architecture, testing and other activities in the software life cycle."
        },
        {
            "degree": "Introduction to Computer Science",
            "institution": "Harvard University",
            "type": "MOOC",
            "location": "",
            "period": "2023",
            "description": "This program covers concepts like abstraction, algorithms, data structures, encapsulation, resource management, security, software engineering, and web development. An introduction to a number of languages, including C, Python, SQL and JavaScript, as well as CSS and HTML."
        },
        {
            "degree": "Professional Title of Software Developer",
            "institution": "OBJECTIF 3W",
            "location": "Montpellier - FR",
            "period": "2015  - 2016",
            "description": "Proficient in a diverse range of programming languages, including XML, HTML5, CSS3, JavaScript, jQuery, Ajax, PHP5, SQL, and UML. Skilled in MySQL DBMS, method of analysis and design of MERISE systems, and experienced in object-oriented programming."
        }
    ],
    "skills": [
        "Full Stack",
        "JavaScript",
        "NodeJS"
    ],
    "languages": [
        {
            "language": "French",
            "level": "Advanced"
        },
        {
            "language": "Portugais",
            "level": "Advanced"
        }
    ],
    "certifications": [
        {
            "certificate": "",
            "institution": "",
            "completionYear": ""
        }
    ]
}